src/CFD/validation-var-Q/pipe_validation_startQ5000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0  -0.15)    // 0
    (1.2   0  -0.15)  // 1
    (1.2  .2 -0.15) // 2
    (0    .2 -0.15)   // 3
    (0     0  0)      // 4
    (1.2   0  0)    // 5
    (1.2  .2  0)   // 6
    (0    .2  0)     // 7

    (19.2  0 -0.15)  // 8
    (19.2 .2 -0.15) // 9
    (19.2  0  0)    // 10
    (19.2 .2  0)   // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 12 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (120 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9) 
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    heatedWall
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 11 10 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
        );
    }
);

// ************************************************************************* //
